## Reading Data From Different Sources

In [15]:
import pandas as pd
from io import StringIO

Data = '{"employee_name" : "James", "email": "james@gmail.com", "job_profile": [{"title1":"Tead Lead", "title2": "Sr.Developer" }]}'

# Take all data and convert into string .io and read it in .json format
df= pd.read_json(StringIO(Data))
df

,employee_name,email,job_profile
0,James,james@gmail.com,"{'title1': 'Tead Lead', 'title2': 'Sr.Developer'}"

In [16]:
# Read dataframe back in .json
df.to_json()
# To get index, we can used orient= index.
df.to_json(orient="index")

'{"0":{"employee_name":"James","email":"james@gmail.com","job_profile":{"title1":"Tead Lead","title2":"Sr.Developer"}}}'

In [17]:
df.to_json(orient="records")

'[{"employee_name":"James","email":"james@gmail.com","job_profile":{"title1":"Tead Lead","title2":"Sr.Developer"}}]'

In [ ]:
# Read data from url, in csv format.
df= pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data", header = None)
df.head()
# Header make column index in 1 to n state.

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [26]:
# Now converting this to into .csv
df.to_csv("wine.csv")

In [44]:
# Read html data.
url= "https://www.fdic.gov/bank-failures/failed-bank-list"

df = pd.read_html(url)

In [45]:
df[0:11]

[                                            Bank Name                City  \
 0                        The Santa Anna National Bank          Santa Anna
 1                                Pulaski Savings Bank             Chicago
 2                  The First National Bank of Lindsay             Lindsay
 3               Republic First Bank dba Republic Bank        Philadelphia
 4                                       Citizens Bank            Sac City
 5                            Heartland Tri-State Bank             Elkhart
 6                                 First Republic Bank       San Francisco
 7                                      Signature Bank            New York
 8                                 Silicon Valley Bank         Santa Clara
 9                                   Almena State Bank              Almena
 10                         First City Bank of Florida   Fort Walton Beach
 11                               The First State Bank       Barboursville
 12                                 Ericson State Bank             Ericson
 13                   City National Bank of New Jersey              Newark
 14                                      Resolute Bank              Maumee
 15                              Louisa Community Bank              Louisa
 16                               The Enloe State Bank              Cooper
 17                Washington Federal Bank for Savings             Chicago
 18    The Farmers and Merchants State Bank of Argonia             Argonia
 19                                Fayette County Bank          Saint Elmo
 20  Guaranty Bank, (d/b/a BestBank in Georgia & Mi...           Milwaukee
 21                                     First NBC Bank         New Orleans
 22                                      Proficio Bank  Cottonwood Heights
 23                      Seaway Bank and Trust Company             Chicago
 24                             Harvest Community Bank          Pennsville

             State   Cert                Acquiring Institution  \
 0           Texas   5520            Coleman County State Bank
 1        Illinois  28611                      Millennium Bank
 2        Oklahoma   4134               First Bank & Trust Co.
 3    Pennsylvania  27332    Fulton Bank, National Association
 4            Iowa   8758            Iowa Trust & Savings Bank
 5          Kansas  25851               Dream First Bank, N.A.
 6      California  59017            JPMorgan Chase Bank, N.A.
 7        New York  57053                  Flagstar Bank, N.A.
 8      California  24735  First Citizens Bank & Trust Company
 9          Kansas  15426                          Equity Bank
 10        Florida  16748            United Fidelity Bank, fsb
 11  West Virginia  14361                       MVB Bank, Inc.
 12       Nebraska  18265           Farmers and Merchants Bank
 13     New Jersey  21111                      Industrial Bank
 14           Ohio  58317                   Buckeye State Bank
 15       Kentucky  58112    Kentucky Farmers Bank Corporation
 16          Texas  10716                   Legend Bank, N. A.
 17       Illinois  30570                   Royal Savings Bank
 18         Kansas  17719                          Conway Bank
 19       Illinois   1802            United Fidelity Bank, fsb
 20      Wisconsin  30003  First-Citizens Bank & Trust Company
 21      Louisiana  58302                         Whitney Bank
 22           Utah  35495                    Cache Valley Bank
 23       Illinois  19328                  State Bank of Texas
 24     New Jersey  34951  First-Citizens Bank & Trust Company

          Closing Date  Fund  Sort ascending
 0       June 27, 2025                 10549
 1    January 17, 2025                 10548
 2    October 18, 2024                 10547
 3      April 26, 2024                 10546
 4    November 3, 2023                 10545
 5       July 28, 2023                 10544
 6         May 1, 2023                 10543
 7      March 12, 2023                 10540
 8      March 10, 2023                 10539
 9    October 23, 2020                 10538
 10   October 16, 2020                 10537
 11      April 3, 2020                 10536
 12  February 14, 2020                 10535
 13   November 1, 2019                 10534
 14   October 25, 2019                 10533
 15   October 25, 2019                 10532
 16       May 31, 2019                 10531
 17  December 15, 2017                 10530
 18   October 13, 2017                 10529
 19       May 26, 2017                 10528
 20        May 5, 2017                 10527
 21     April 28, 2017                 10526
 22      March 3, 2017                 10525
 23   January 27, 2017                 10524
 24   January 13, 2017                 10523  ]

In [49]:
import pandas as pd

# Read data from html page with match keyword.

url = "https://www.ssl.com/country-codes/"

df = pd.read_html(url, match="Name", header = 0)[0]
df

                  Name ISO Code for CSR
0          Afghanistan               AF
1        Aland Islands               AX
2              Albania               AL
3              Algeria               DZ
4       American Samoa               AS
..                 ...              ...
237  Wallis and Futuna               WF
238     Western Sahara               EH
239              Yemen               YE
240             Zambia               ZM
241           Zimbabwe               ZW

[242 rows x 2 columns]

In [50]:
# Read excel file.
# pd.read_excel("Data.xlsx")

df.to_excel("country_code.xlsx")

In [ ]:
# Converting this html into excel file(xlsx.)

In [ ]:
# Converting into pickle file.

# Pickle File-> Pickle in python is primarily used in serializing and deserializing a python object structure.

# In other word it's the process of converting the a python objec tinto a byte stream to store it in a file/datebase, maintian program state across sessions, or transport data over the network.

In [ ]:
# Make file in pickle file.
df.to_pickle('df')
# This file is not open.

In [53]:
# Read pickle file.
pd.read_pickle('df')

                  Name ISO Code for CSR
0          Afghanistan               AF
1        Aland Islands               AX
2              Albania               AL
3              Algeria               DZ
4       American Samoa               AS
..                 ...              ...
237  Wallis and Futuna               WF
238     Western Sahara               EH
239              Yemen               YE
240             Zambia               ZM
241           Zimbabwe               ZW

[242 rows x 2 columns]